---
title: ExportIFCCategoryInfo
classe: Autodesk.Revit.DB.ExportIFCCategoryInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ExportIFCCategoryInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String IFCEntityName { get; set; }` | `exportIFCCategoryInfo.IFCEntityName` | String |
| `Boolean IFCExportFlag { get; set; }` | `exportIFCCategoryInfo.IFCExportFlag` | Boolean |
| `String IFCPredefinedType { get; set; }` | `exportIFCCategoryInfo.IFCPredefinedType` | String |
| `String IFCPresentationLayerName { get; set; }` | `exportIFCCategoryInfo.IFCPresentationLayerName` | String |
| `String IFCUserDefinedType { get; set; }` | `exportIFCCategoryInfo.IFCUserDefinedType` | String |
| `Boolean IsValidObject { get; }` | `exportIFCCategoryInfo.IsValidObject` | Boolean |
| `Void Dispose()` | `exportIFCCategoryInfo.Dispose()` | Void |
| `Boolean IsDefault()` | `exportIFCCategoryInfo.IsDefault()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```